app/Controllers/Home.php

    public function getPlats(){
        if (! session()->get('logged_in')) {
            return redirect()->to('/');
        }
        $model = new PlatsModel();
        $plats = $model->findAll();
---
SELECT *
FROM `plats`