app/Controllers/User.php

SELECT *
FROM `users`
WHERE `email` = 'hoty@gmail.com'
 LIMIT 1
---
    public function loginUser()
    {
        $model = new UsersModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();